zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_SGI.h
/*
** ###################################################################
**     Processors:          MCXW70ACMFT
**                          MCXW70ACMMP
**                          MCXW70ADMFT
**                          MCXW70ADMMP
**
**     Version:             rev. 1.0, 2026-01-09
**     Build:               b260813
**
**     Abstract:
**         CMSIS Peripheral Access Layer for SGI
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2026 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2026-01-09)
**         Initial version.
**
** ###################################################################
*/

/*!
 * @file PERI_SGI.h
 * @version 1.0
 * @date 2026-01-09
 * @brief CMSIS Peripheral Access Layer for SGI
 *
 * CMSIS Peripheral Access Layer for SGI
 */

#if !defined(PERI_SGI_H_)
#define PERI_SGI_H_                              /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MCXW70ACMFT) || defined(CPU_MCXW70ACMMP))
#include "MCXW70AC_COMMON.h"
#elif (defined(CPU_MCXW70ADMFT) || defined(CPU_MCXW70ADMMP))
#include "MCXW70AD_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- SGI Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SGI_Peripheral_Access_Layer SGI Peripheral Access Layer
 * @{
 */

/** SGI - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[512];
  __IO uint32_t SGI_DATIN0A;                       /**< Input Data register 0 - Word-3, offset: 0x200 */
  __IO uint32_t SGI_DATIN0B;                       /**< Input Data register 0 - Word-2, offset: 0x204 */
  __IO uint32_t SGI_DATIN0C;                       /**< Input Data register 0 - Word-1, offset: 0x208 */
  __IO uint32_t SGI_DATIN0D;                       /**< Input Data register 0 - Word-0, offset: 0x20C */
  __IO uint32_t SGI_DATIN1A;                       /**< Input Data register 1 - Word-3, offset: 0x210 */
  __IO uint32_t SGI_DATIN1B;                       /**< Input Data register 1 - Word-2, offset: 0x214 */
  __IO uint32_t SGI_DATIN1C;                       /**< Input Data register 1 - Word-1, offset: 0x218 */
  __IO uint32_t SGI_DATIN1D;                       /**< Input Data register 1 - Word-0, offset: 0x21C */
  __IO uint32_t SGI_DATIN2A;                       /**< Input Data register 2 - Word-3, offset: 0x220 */
  __IO uint32_t SGI_DATIN2B;                       /**< Input Data register 2 - Word-2, offset: 0x224 */
  __IO uint32_t SGI_DATIN2C;                       /**< Input Data register 2 - Word-1, offset: 0x228 */
  __IO uint32_t SGI_DATIN2D;                       /**< Input Data register 2 - Word-0, offset: 0x22C */
  __IO uint32_t SGI_DATIN3A;                       /**< Input Data register 3 - Word-3, offset: 0x230 */
  __IO uint32_t SGI_DATIN3B;                       /**< Input Data register 3 - Word-2, offset: 0x234 */
  __IO uint32_t SGI_DATIN3C;                       /**< Input Data register 3 - Word-1, offset: 0x238 */
  __IO uint32_t SGI_DATIN3D;                       /**< Input Data register 3 - Word-0, offset: 0x23C */
  __IO uint32_t SGI_KEY0A;                         /**< Input Key register 0 - Word-3, offset: 0x240 */
  __IO uint32_t SGI_KEY0B;                         /**< Input Key register 0 - Word-2, offset: 0x244 */
  __IO uint32_t SGI_KEY0C;                         /**< Input Key register 0 - Word-1, offset: 0x248 */
  __IO uint32_t SGI_KEY0D;                         /**< Input Key register 0 - Word-0, offset: 0x24C */
  __IO uint32_t SGI_KEY1A;                         /**< Input Key register 1 - Word-3, offset: 0x250 */
  __IO uint32_t SGI_KEY1B;                         /**< Input Key register 1 - Word-2, offset: 0x254 */
  __IO uint32_t SGI_KEY1C;                         /**< Input Key register 1 - Word-1, offset: 0x258 */
  __IO uint32_t SGI_KEY1D;                         /**< Input Key register 1 - Word-0, offset: 0x25C */
  __IO uint32_t SGI_KEY2A;                         /**< Input Key register 2 - Word-3, offset: 0x260 */
  __IO uint32_t SGI_KEY2B;                         /**< Input Key register 2 - Word-2, offset: 0x264 */
  __IO uint32_t SGI_KEY2C;                         /**< Input Key register 2 - Word-1, offset: 0x268 */
  __IO uint32_t SGI_KEY2D;                         /**< Input Key register 2 - Word-0, offset: 0x26C */
  __IO uint32_t SGI_KEY3A;                         /**< Input Key register 3 - Word-3, offset: 0x270 */
  __IO uint32_t SGI_KEY3B;                         /**< Input Key register 3 - Word-2, offset: 0x274 */
  __IO uint32_t SGI_KEY3C;                         /**< Input Key register 3 - Word-1, offset: 0x278 */
  __IO uint32_t SGI_KEY3D;                         /**< Input Key register 3 - Word-0, offset: 0x27C */
  __IO uint32_t SGI_KEY4A;                         /**< Input Key register 4 - Word-3, offset: 0x280 */
  __IO uint32_t SGI_KEY4B;                         /**< Input Key register 4 - Word-2, offset: 0x284 */
  __IO uint32_t SGI_KEY4C;                         /**< Input Key register 4 - Word-1, offset: 0x288 */
  __IO uint32_t SGI_KEY4D;                         /**< Input Key register 4 - Word-0, offset: 0x28C */
  __IO uint32_t SGI_KEY5A;                         /**< Input Key register 5 - Word-3, offset: 0x290 */
  __IO uint32_t SGI_KEY5B;                         /**< Input Key register 5 - Word-2, offset: 0x294 */
  __IO uint32_t SGI_KEY5C;                         /**< Input Key register 5 - Word-1, offset: 0x298 */
  __IO uint32_t SGI_KEY5D;                         /**< Input Key register 5 - Word-0, offset: 0x29C */
  __IO uint32_t SGI_KEY6A;                         /**< Input Key register 6 - Word-3, offset: 0x2A0 */
  __IO uint32_t SGI_KEY6B;                         /**< Input Key register 6 - Word-2, offset: 0x2A4 */
  __IO uint32_t SGI_KEY6C;                         /**< Input Key register 6 - Word-1, offset: 0x2A8 */
  __IO uint32_t SGI_KEY6D;                         /**< Input Key register 6 - Word-0, offset: 0x2AC */
  __IO uint32_t SGI_KEY7A;                         /**< Input Key register 7 - Word-3, offset: 0x2B0 */
  __IO uint32_t SGI_KEY7B;                         /**< Input Key register 7 - Word-2, offset: 0x2B4 */
  __IO uint32_t SGI_KEY7C;                         /**< Input Key register 7 - Word-1, offset: 0x2B8 */
  __IO uint32_t SGI_KEY7D;                         /**< Input Key register 7 - Word-0, offset: 0x2BC */
  __IO uint32_t SGI_DATOUTA;                       /**< Output Data register - Word-3, offset: 0x2C0 */
  __IO uint32_t SGI_DATOUTB;                       /**< Output Data register - Word-2, offset: 0x2C4 */
  __IO uint32_t SGI_DATOUTC;                       /**< Output Data register - Word-1, offset: 0x2C8 */
  __IO uint32_t SGI_DATOUTD;                       /**< Output Data register - Word-0, offset: 0x2CC */
       uint8_t RESERVED_1[2352];
  __IO uint32_t SGI_STATUS;                        /**< Status register, offset: 0xC00 */
  __IO uint32_t SGI_COUNT;                         /**< Calculation counter, offset: 0xC04 */
  __IO uint32_t SGI_KEYCHK;                        /**< Key checksum register, offset: 0xC08 */
  __IO uint32_t SGI_PRNG_SW_READ;                  /**< SGI PRNG read register, offset: 0xC0C */
       uint8_t RESERVED_2[240];
  __IO uint32_t SGI_CTRL;                          /**< SGI Control register, offset: 0xD00 */
  __IO uint32_t SGI_CTRL2;                         /**< SGI Control register 2, offset: 0xD04 */
  __IO uint32_t SGI_DUMMY_CTRL;                    /**< Configuration of dummy controls, offset: 0xD08 */
       uint8_t RESERVED_3[4];
  __IO uint32_t SGI_SFRSEED;                       /**< SFRSEED register for SFRMASK feature, offset: 0xD10 */
  __IO uint32_t SGI_SHA2_CTRL;                     /**< SHA Control Register, offset: 0xD14 */
  __IO uint32_t SGI_SHA_FIFO;                      /**< SHA FIFO lower-bank low, offset: 0xD18 */
  __I  uint32_t SGI_CONFIG;                        /**< SHA Configuration Reg, offset: 0xD1C */
  __I  uint32_t SGI_CONFIG2;                       /**< SHA Configuration 2 Reg, offset: 0xD20 */
  __IO uint32_t SGI_AUTO_MODE;                     /**< SGI Auto Mode Control register, offset: 0xD24 */
  __IO uint32_t SGI_AUTO_DMA_CTRL;                 /**< SGI Auto Mode Control register, offset: 0xD28 */
       uint8_t RESERVED_4[4];
  __IO uint32_t SGI_PRNG_SW_SEED;                  /**< SGI internal PRNG SW seeding register, offset: 0xD30 */
       uint8_t RESERVED_5[12];
  __IO uint32_t SGI_KEY_CTRL;                      /**< SGI Key Control SFR, offset: 0xD40 */
       uint8_t RESERVED_6[12];
  __I  uint32_t SGI_KEY_WRAP;                      /**< Wrapped key read SFR, offset: 0xD50 */
       uint8_t RESERVED_7[436];
  __I  uint32_t SGI_VERSION;                       /**< SGI Version, offset: 0xF08 */
       uint8_t RESERVED_8[180];
  __IO uint32_t SGI_ACCESS_ERR;                    /**< Access Error, offset: 0xFC0 */
  __IO uint32_t SGI_ACCESS_ERR_CLR;                /**< Clear Access Error, offset: 0xFC4 */
       uint8_t RESERVED_9[24];
  __I  uint32_t SGI_INT_STATUS;                    /**< Interrupt status, offset: 0xFE0 */
  __IO uint32_t SGI_INT_ENABLE;                    /**< Interrupt enable, offset: 0xFE4 */
  __IO uint32_t SGI_INT_STATUS_CLR;                /**< Interrupt status clear, offset: 0xFE8 */
  __IO uint32_t SGI_INT_STATUS_SET;                /**< Interrupt status set, offset: 0xFEC */
       uint8_t RESERVED_10[12];
  __I  uint32_t SGI_MODULE_ID;                     /**< Module ID, offset: 0xFFC */
} SGI_Type;

/* ----------------------------------------------------------------------------
   -- SGI Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SGI_Register_Masks SGI Register Masks
 * @{
 */

/*! @name SGI_DATIN0A - Input Data register 0 - Word-3 */
/*! @{ */

#define SGI_SGI_DATIN0A_DATIN0A_MASK             (0xFFFFFFFFU)
#define SGI_SGI_DATIN0A_DATIN0A_SHIFT            (0U)
/*! DATIN0A - Input Data register */
#define SGI_SGI_DATIN0A_DATIN0A(x)               (((uint32_t)(((uint32_t)(x)) << SGI_SGI_DATIN0A_DATIN0A_SHIFT)) & SGI_SGI_DATIN0A_DATIN0A_MASK)
/*! @} */

/*! @name SGI_DATIN0B - Input Data register 0 - Word-2 */
/*! @{ */

#define SGI_SGI_DATIN0B_DATIN0B_MASK             (0xFFFFFFFFU)
#define SGI_SGI_DATIN0B_DATIN0B_SHIFT            (0U)
/*! DATIN0B - Input Data register */
#define SGI_SGI_DATIN0B_DATIN0B(x)               (((uint32_t)(((uint32_t)(x)) << SGI_SGI_DATIN0B_DATIN0B_SHIFT)) & SGI_SGI_DATIN0B_DATIN0B_MASK)
/*! @} */

/*! @name SGI_DATIN0C - Input Data register 0 - Word-1 */
/*! @{ */

#define SGI_SGI_DATIN0C_DATIN0C_MASK             (0xFFFFFFFFU)
#define SGI_SGI_DATIN0C_DATIN0C_SHIFT            (0U)
/*! DATIN0C - Input Data register */
#define SGI_SGI_DATIN0C_DATIN0C(x)               (((uint32_t)(((uint32_t)(x)) << SGI_SGI_DATIN0C_DATIN0C_SHIFT)) & SGI_SGI_DATIN0C_DATIN0C_MASK)
/*! @} */

