zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_SGI.h
/*! @name SGI_KEY1B - Input Key register 1 - Word-2 */
/*! @{ */

#define SGI_SGI_KEY1B_KEY1B_MASK                 (0xFFFFFFFFU)
#define SGI_SGI_KEY1B_KEY1B_SHIFT                (0U)
/*! KEY1B - Input Key register */
#define SGI_SGI_KEY1B_KEY1B(x)                   (((uint32_t)(((uint32_t)(x)) << SGI_SGI_KEY1B_KEY1B_SHIFT)) & SGI_SGI_KEY1B_KEY1B_MASK)
/*! @} */

/*! @name SGI_KEY1C - Input Key register 1 - Word-1 */
/*! @{ */

#define SGI_SGI_KEY1C_KEY1C_MASK                 (0xFFFFFFFFU)
#define SGI_SGI_KEY1C_KEY1C_SHIFT                (0U)
/*! KEY1C - Input Key register */
#define SGI_SGI_KEY1C_KEY1C(x)                   (((uint32_t)(((uint32_t)(x)) << SGI_SGI_KEY1C_KEY1C_SHIFT)) & SGI_SGI_KEY1C_KEY1C_MASK)
/*! @} */

/*! @name SGI_KEY1D - Input Key register 1 - Word-0 */
/*! @{ */

#define SGI_SGI_KEY1D_KEY1D_MASK                 (0xFFFFFFFFU)
#define SGI_SGI_KEY1D_KEY1D_SHIFT                (0U)
/*! KEY1D - Input Key register */
#define SGI_SGI_KEY1D_KEY1D(x)                   (((uint32_t)(((uint32_t)(x)) << SGI_SGI_KEY1D_KEY1D_SHIFT)) & SGI_SGI_KEY1D_KEY1D_MASK)
/*! @} */

/*! @name SGI_KEY2A - Input Key register 2 - Word-3 */
/*! @{ */

#define SGI_SGI_KEY2A_KEY2A_MASK                 (0xFFFFFFFFU)
#define SGI_SGI_KEY2A_KEY2A_SHIFT                (0U)
/*! KEY2A - Input Key register */
#define SGI_SGI_KEY2A_KEY2A(x)                   (((uint32_t)(((uint32_t)(x)) << SGI_SGI_KEY2A_KEY2A_SHIFT)) & SGI_SGI_KEY2A_KEY2A_MASK)
/*! @} */

/*! @name SGI_KEY2B - Input Key register 2 - Word-2 */
/*! @{ */

#define SGI_SGI_KEY2B_KEY2B_MASK                 (0xFFFFFFFFU)
#define SGI_SGI_KEY2B_KEY2B_SHIFT                (0U)
/*! KEY2B - Input Key register */
#define SGI_SGI_KEY2B_KEY2B(x)                   (((uint32_t)(((uint32_t)(x)) << SGI_SGI_KEY2B_KEY2B_SHIFT)) & SGI_SGI_KEY2B_KEY2B_MASK)
/*! @} */

/*! @name SGI_KEY2C - Input Key register 2 - Word-1 */
/*! @{ */

#define SGI_SGI_KEY2C_KEY2C_MASK                 (0xFFFFFFFFU)
#define SGI_SGI_KEY2C_KEY2C_SHIFT                (0U)
/*! KEY2C - Input Key register */
#define SGI_SGI_KEY2C_KEY2C(x)                   (((uint32_t)(((uint32_t)(x)) << SGI_SGI_KEY2C_KEY2C_SHIFT)) & SGI_SGI_KEY2C_KEY2C_MASK)
/*! @} */

/*! @name SGI_KEY2D - Input Key register 2 - Word-0 */
/*! @{ */

#define SGI_SGI_KEY2D_KEY2D_MASK                 (0xFFFFFFFFU)
#define SGI_SGI_KEY2D_KEY2D_SHIFT                (0U)
/*! KEY2D - Input Key register */
#define SGI_SGI_KEY2D_KEY2D(x)                   (((uint32_t)(((uint32_t)(x)) << SGI_SGI_KEY2D_KEY2D_SHIFT)) & SGI_SGI_KEY2D_KEY2D_MASK)
/*! @} */

/*! @name SGI_KEY3A - Input Key register 3 - Word-3 */
/*! @{ */

#define SGI_SGI_KEY3A_KEY3A_MASK                 (0xFFFFFFFFU)
#define SGI_SGI_KEY3A_KEY3A_SHIFT                (0U)
/*! KEY3A - Input Key register */
#define SGI_SGI_KEY3A_KEY3A(x)                   (((uint32_t)(((uint32_t)(x)) << SGI_SGI_KEY3A_KEY3A_SHIFT)) & SGI_SGI_KEY3A_KEY3A_MASK)
/*! @} */

/*! @name SGI_KEY3B - Input Key register 3 - Word-2 */
/*! @{ */

#define SGI_SGI_KEY3B_KEY3B_MASK                 (0xFFFFFFFFU)
#define SGI_SGI_KEY3B_KEY3B_SHIFT                (0U)
/*! KEY3B - Input Key register */
#define SGI_SGI_KEY3B_KEY3B(x)                   (((uint32_t)(((uint32_t)(x)) << SGI_SGI_KEY3B_KEY3B_SHIFT)) & SGI_SGI_KEY3B_KEY3B_MASK)
/*! @} */

/*! @name SGI_KEY3C - Input Key register 3 - Word-1 */
/*! @{ */

#define SGI_SGI_KEY3C_KEY3C_MASK                 (0xFFFFFFFFU)
#define SGI_SGI_KEY3C_KEY3C_SHIFT                (0U)
/*! KEY3C - Input Key register */
#define SGI_SGI_KEY3C_KEY3C(x)                   (((uint32_t)(((uint32_t)(x)) << SGI_SGI_KEY3C_KEY3C_SHIFT)) & SGI_SGI_KEY3C_KEY3C_MASK)
/*! @} */

/*! @name SGI_KEY3D - Input Key register 3 - Word-0 */
/*! @{ */

#define SGI_SGI_KEY3D_KEY3D_MASK                 (0xFFFFFFFFU)
#define SGI_SGI_KEY3D_KEY3D_SHIFT                (0U)
/*! KEY3D - Input Key register */
#define SGI_SGI_KEY3D_KEY3D(x)                   (((uint32_t)(((uint32_t)(x)) << SGI_SGI_KEY3D_KEY3D_SHIFT)) & SGI_SGI_KEY3D_KEY3D_MASK)
/*! @} */

/*! @name SGI_KEY4A - Input Key register 4 - Word-3 */
/*! @{ */

#define SGI_SGI_KEY4A_KEY4A_MASK                 (0xFFFFFFFFU)
#define SGI_SGI_KEY4A_KEY4A_SHIFT                (0U)
/*! KEY4A - Input Key register */
#define SGI_SGI_KEY4A_KEY4A(x)                   (((uint32_t)(((uint32_t)(x)) << SGI_SGI_KEY4A_KEY4A_SHIFT)) & SGI_SGI_KEY4A_KEY4A_MASK)
/*! @} */

/*! @name SGI_KEY4B - Input Key register 4 - Word-2 */
/*! @{ */

#define SGI_SGI_KEY4B_KEY4B_MASK                 (0xFFFFFFFFU)
#define SGI_SGI_KEY4B_KEY4B_SHIFT                (0U)
/*! KEY4B - Input Key register */
#define SGI_SGI_KEY4B_KEY4B(x)                   (((uint32_t)(((uint32_t)(x)) << SGI_SGI_KEY4B_KEY4B_SHIFT)) & SGI_SGI_KEY4B_KEY4B_MASK)
/*! @} */

/*! @name SGI_KEY4C - Input Key register 4 - Word-1 */
/*! @{ */

#define SGI_SGI_KEY4C_KEY4C_MASK                 (0xFFFFFFFFU)
#define SGI_SGI_KEY4C_KEY4C_SHIFT                (0U)
/*! KEY4C - Input Key register */
#define SGI_SGI_KEY4C_KEY4C(x)                   (((uint32_t)(((uint32_t)(x)) << SGI_SGI_KEY4C_KEY4C_SHIFT)) & SGI_SGI_KEY4C_KEY4C_MASK)
/*! @} */

/*! @name SGI_KEY4D - Input Key register 4 - Word-0 */
/*! @{ */

#define SGI_SGI_KEY4D_KEY4D_MASK                 (0xFFFFFFFFU)
#define SGI_SGI_KEY4D_KEY4D_SHIFT                (0U)
/*! KEY4D - Input Key register */
#define SGI_SGI_KEY4D_KEY4D(x)                   (((uint32_t)(((uint32_t)(x)) << SGI_SGI_KEY4D_KEY4D_SHIFT)) & SGI_SGI_KEY4D_KEY4D_MASK)
/*! @} */

/*! @name SGI_KEY5A - Input Key register 5 - Word-3 */
/*! @{ */

#define SGI_SGI_KEY5A_KEY5A_MASK                 (0xFFFFFFFFU)
#define SGI_SGI_KEY5A_KEY5A_SHIFT                (0U)
/*! KEY5A - Input Key register */
#define SGI_SGI_KEY5A_KEY5A(x)                   (((uint32_t)(((uint32_t)(x)) << SGI_SGI_KEY5A_KEY5A_SHIFT)) & SGI_SGI_KEY5A_KEY5A_MASK)
/*! @} */

/*! @name SGI_KEY5B - Input Key register 5 - Word-2 */
/*! @{ */

#define SGI_SGI_KEY5B_KEY5B_MASK                 (0xFFFFFFFFU)
#define SGI_SGI_KEY5B_KEY5B_SHIFT                (0U)
/*! KEY5B - Input Key register */
#define SGI_SGI_KEY5B_KEY5B(x)                   (((uint32_t)(((uint32_t)(x)) << SGI_SGI_KEY5B_KEY5B_SHIFT)) & SGI_SGI_KEY5B_KEY5B_MASK)
/*! @} */

/*! @name SGI_KEY5C - Input Key register 5 - Word-1 */
/*! @{ */

#define SGI_SGI_KEY5C_KEY5C_MASK                 (0xFFFFFFFFU)
#define SGI_SGI_KEY5C_KEY5C_SHIFT                (0U)
/*! KEY5C - Input Key register */
#define SGI_SGI_KEY5C_KEY5C(x)                   (((uint32_t)(((uint32_t)(x)) << SGI_SGI_KEY5C_KEY5C_SHIFT)) & SGI_SGI_KEY5C_KEY5C_MASK)
/*! @} */

/*! @name SGI_KEY5D - Input Key register 5 - Word-0 */
/*! @{ */

#define SGI_SGI_KEY5D_KEY5D_MASK                 (0xFFFFFFFFU)
#define SGI_SGI_KEY5D_KEY5D_SHIFT                (0U)
/*! KEY5D - Input Key register */
#define SGI_SGI_KEY5D_KEY5D(x)                   (((uint32_t)(((uint32_t)(x)) << SGI_SGI_KEY5D_KEY5D_SHIFT)) & SGI_SGI_KEY5D_KEY5D_MASK)
/*! @} */

