zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_SGI.h
#define SGI_SGI_AUTO_DMA_CTRL_OFE_MASK           (0x100U)
#define SGI_SGI_AUTO_DMA_CTRL_OFE_SHIFT          (8U)
/*! OFE - Ouput FIFO DMA Enable
 *  0b0..DMA handshake disabled
 *  0b1..DMA handshake enabled
 */
#define SGI_SGI_AUTO_DMA_CTRL_OFE(x)             (((uint32_t)(((uint32_t)(x)) << SGI_SGI_AUTO_DMA_CTRL_OFE_SHIFT)) & SGI_SGI_AUTO_DMA_CTRL_OFE_MASK)
/*! @} */

/*! @name SGI_PRNG_SW_SEED - SGI internal PRNG SW seeding register */
/*! @{ */

#define SGI_SGI_PRNG_SW_SEED_SEED_MASK           (0xFFFFFFFFU)
#define SGI_SGI_PRNG_SW_SEED_SEED_SHIFT          (0U)
#define SGI_SGI_PRNG_SW_SEED_SEED(x)             (((uint32_t)(((uint32_t)(x)) << SGI_SGI_PRNG_SW_SEED_SEED_SHIFT)) & SGI_SGI_PRNG_SW_SEED_SEED_MASK)
/*! @} */

/*! @name SGI_KEY_CTRL - SGI Key Control SFR */
/*! @{ */

#define SGI_SGI_KEY_CTRL_KEY_WO_MASK             (0xFFFFFFFFU)
#define SGI_SGI_KEY_CTRL_KEY_WO_SHIFT            (0U)
#define SGI_SGI_KEY_CTRL_KEY_WO(x)               (((uint32_t)(((uint32_t)(x)) << SGI_SGI_KEY_CTRL_KEY_WO_SHIFT)) & SGI_SGI_KEY_CTRL_KEY_WO_MASK)
/*! @} */

/*! @name SGI_KEY_WRAP - Wrapped key read SFR */
/*! @{ */

#define SGI_SGI_KEY_WRAP_KW_DATA_MASK            (0xFFFFFFFFU)
#define SGI_SGI_KEY_WRAP_KW_DATA_SHIFT           (0U)
/*! KW_DATA - Field contains wrapped key, auto-updated by HW for each word */
#define SGI_SGI_KEY_WRAP_KW_DATA(x)              (((uint32_t)(((uint32_t)(x)) << SGI_SGI_KEY_WRAP_KW_DATA_SHIFT)) & SGI_SGI_KEY_WRAP_KW_DATA_MASK)
/*! @} */

/*! @name SGI_VERSION - SGI Version */
/*! @{ */

#define SGI_SGI_VERSION_Z_MASK                   (0xFU)
#define SGI_SGI_VERSION_Z_SHIFT                  (0U)
/*! Z - Extended revision number in X.Y1Y2.Z, e.g. 1.20.3. */
#define SGI_SGI_VERSION_Z(x)                     (((uint32_t)(((uint32_t)(x)) << SGI_SGI_VERSION_Z_SHIFT)) & SGI_SGI_VERSION_Z_MASK)

#define SGI_SGI_VERSION_Y2_MASK                  (0xF0U)
#define SGI_SGI_VERSION_Y2_SHIFT                 (4U)
/*! Y2 - Minor revision number 2 in X.Y1Y2.Z, e.g. 1.20.3. */
#define SGI_SGI_VERSION_Y2(x)                    (((uint32_t)(((uint32_t)(x)) << SGI_SGI_VERSION_Y2_SHIFT)) & SGI_SGI_VERSION_Y2_MASK)

#define SGI_SGI_VERSION_Y1_MASK                  (0xF00U)
#define SGI_SGI_VERSION_Y1_SHIFT                 (8U)
/*! Y1 - Minor revision number 1 in X.Y1Y2.Z, e.g. 1.20.3. */
#define SGI_SGI_VERSION_Y1(x)                    (((uint32_t)(((uint32_t)(x)) << SGI_SGI_VERSION_Y1_SHIFT)) & SGI_SGI_VERSION_Y1_MASK)

#define SGI_SGI_VERSION_X_MASK                   (0xF000U)
#define SGI_SGI_VERSION_X_SHIFT                  (12U)
/*! X - Major revision number in X.Y1Y2.Z, e.g. 1.20.3. */
#define SGI_SGI_VERSION_X(x)                     (((uint32_t)(((uint32_t)(x)) << SGI_SGI_VERSION_X_SHIFT)) & SGI_SGI_VERSION_X_MASK)

#define SGI_SGI_VERSION_MILESTONE_MASK           (0x30000U)
#define SGI_SGI_VERSION_MILESTONE_SHIFT          (16U)
/*! MILESTONE
 *  0b00..PREL
 *  0b01..BR
 *  0b10..SI
 *  0b11..GO
 */
#define SGI_SGI_VERSION_MILESTONE(x)             (((uint32_t)(((uint32_t)(x)) << SGI_SGI_VERSION_MILESTONE_SHIFT)) & SGI_SGI_VERSION_MILESTONE_MASK)
/*! @} */

/*! @name SGI_ACCESS_ERR - Access Error */
/*! @{ */

#define SGI_SGI_ACCESS_ERR_APB_NOTAV_MASK        (0x1U)
#define SGI_SGI_ACCESS_ERR_APB_NOTAV_SHIFT       (0U)
/*! APB_NOTAV - APB Error: address not available */
#define SGI_SGI_ACCESS_ERR_APB_NOTAV(x)          (((uint32_t)(((uint32_t)(x)) << SGI_SGI_ACCESS_ERR_APB_NOTAV_SHIFT)) & SGI_SGI_ACCESS_ERR_APB_NOTAV_MASK)

#define SGI_SGI_ACCESS_ERR_APB_WRGMD_MASK        (0x2U)
#define SGI_SGI_ACCESS_ERR_APB_WRGMD_SHIFT       (1U)
/*! APB_WRGMD - APB Error: Wrong access mode */
#define SGI_SGI_ACCESS_ERR_APB_WRGMD(x)          (((uint32_t)(((uint32_t)(x)) << SGI_SGI_ACCESS_ERR_APB_WRGMD_SHIFT)) & SGI_SGI_ACCESS_ERR_APB_WRGMD_MASK)

#define SGI_SGI_ACCESS_ERR_APB_MASTER_MASK       (0xF0U)
#define SGI_SGI_ACCESS_ERR_APB_MASTER_SHIFT      (4U)
#define SGI_SGI_ACCESS_ERR_APB_MASTER(x)         (((uint32_t)(((uint32_t)(x)) << SGI_SGI_ACCESS_ERR_APB_MASTER_SHIFT)) & SGI_SGI_ACCESS_ERR_APB_MASTER_MASK)
/*! @} */

/*! @name SGI_ACCESS_ERR_CLR - Clear Access Error */
/*! @{ */

#define SGI_SGI_ACCESS_ERR_CLR_ERR_CLR_MASK      (0x1U)
#define SGI_SGI_ACCESS_ERR_CLR_ERR_CLR_SHIFT     (0U)
/*! ERR_CLR - Write to reset SGI_ACCESS_ERR SFR. */
#define SGI_SGI_ACCESS_ERR_CLR_ERR_CLR(x)        (((uint32_t)(((uint32_t)(x)) << SGI_SGI_ACCESS_ERR_CLR_ERR_CLR_SHIFT)) & SGI_SGI_ACCESS_ERR_CLR_ERR_CLR_MASK)
/*! @} */

/*! @name SGI_INT_STATUS - Interrupt status */
/*! @{ */

#define SGI_SGI_INT_STATUS_INT_PDONE_MASK        (0x1U)
#define SGI_SGI_INT_STATUS_INT_PDONE_SHIFT       (0U)
#define SGI_SGI_INT_STATUS_INT_PDONE(x)          (((uint32_t)(((uint32_t)(x)) << SGI_SGI_INT_STATUS_INT_PDONE_SHIFT)) & SGI_SGI_INT_STATUS_INT_PDONE_MASK)
/*! @} */

/*! @name SGI_INT_ENABLE - Interrupt enable */
/*! @{ */

#define SGI_SGI_INT_ENABLE_INT_EN_MASK           (0x1U)
#define SGI_SGI_INT_ENABLE_INT_EN_SHIFT          (0U)
/*! INT_EN - Interrupt enable bit */
#define SGI_SGI_INT_ENABLE_INT_EN(x)             (((uint32_t)(((uint32_t)(x)) << SGI_SGI_INT_ENABLE_INT_EN_SHIFT)) & SGI_SGI_INT_ENABLE_INT_EN_MASK)
/*! @} */

/*! @name SGI_INT_STATUS_CLR - Interrupt status clear */
/*! @{ */

#define SGI_SGI_INT_STATUS_CLR_INT_CLR_MASK      (0x1U)
#define SGI_SGI_INT_STATUS_CLR_INT_CLR_SHIFT     (0U)
/*! INT_CLR - Write to clear interrupt status flag (SGI_INT_STATUS.INT_PDONE=0). */
#define SGI_SGI_INT_STATUS_CLR_INT_CLR(x)        (((uint32_t)(((uint32_t)(x)) << SGI_SGI_INT_STATUS_CLR_INT_CLR_SHIFT)) & SGI_SGI_INT_STATUS_CLR_INT_CLR_MASK)
/*! @} */

/*! @name SGI_INT_STATUS_SET - Interrupt status set */
/*! @{ */

#define SGI_SGI_INT_STATUS_SET_INT_SET_MASK      (0x1U)
#define SGI_SGI_INT_STATUS_SET_INT_SET_SHIFT     (0U)
/*! INT_SET - Write to set interrupt status flag (SGI_INT_STATUS.INT_PDONE=1) to trigger a SGI
 *    interrupt via software, e.g. for debug purposes.
 */
#define SGI_SGI_INT_STATUS_SET_INT_SET(x)        (((uint32_t)(((uint32_t)(x)) << SGI_SGI_INT_STATUS_SET_INT_SET_SHIFT)) & SGI_SGI_INT_STATUS_SET_INT_SET_MASK)
/*! @} */

/*! @name SGI_MODULE_ID - Module ID */
/*! @{ */

#define SGI_SGI_MODULE_ID_PLACEHOLDER_MASK       (0xFFFFFFFFU)
#define SGI_SGI_MODULE_ID_PLACEHOLDER_SHIFT      (0U)
/*! PLACEHOLDER - Module ID */
#define SGI_SGI_MODULE_ID_PLACEHOLDER(x)         (((uint32_t)(((uint32_t)(x)) << SGI_SGI_MODULE_ID_PLACEHOLDER_SHIFT)) & SGI_SGI_MODULE_ID_PLACEHOLDER_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group SGI_Register_Masks */


/*!
 * @}
 */ /* end of group SGI_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_SGI_H_ */

